<?php
/*** Obfuscator IAM TUBASYA ***/
function tubasya_encode($file){
$awal=array("a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z","1","2","3","4","5","6","7","8","9","0","A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z",'+','=','/',')',';','(','"',"'");
$akhir=array("ا","ب","ت","‌‌ث","ج","ح","خ","د","ذ","ر","ز","س","ص","ض","ط","ظ","ع","ڠ","ۏ","ڤ","ك","ل","م","ن","و","ي","١","٢","٣","٤","٥","٦","٧","٨","٩","٠","⓿","❶","❷","❸","⓪","❹","❺","❻","❼","❽","❾","❿","⑳","⑲","⑱","⑰","⑯","⑮","⑭","⑬","⑫","⑪","⑩","⑨","⑧","⑦","�",'〤',"                                                                                                                    ",'‣','exit;','〆','ㄿ','ㄿ');
$file=str_replace($awal,$akhir,$file);
return $file;
}
function tubasya_decode($file){
     $akhir=array("a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z","1","2","3","4","5","6","7","8","9","0","A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z",'+','=','/',')',';','(','"',"'");
     $awal=array("ا","ب","ت","‌‌ث","ج","ح","خ","د","ذ","ر","ز","س","ص","ض","ط","ظ","ع","ڠ","ۏ","ڤ","ك","ل","م","ن","و","ي","١","٢","٣","٤","٥","٦","٧","٨","٩","٠","⓿","❶","❷","❸","⓪","❹","❺","❻","❼","❽","❾","❿","⑳","⑲","⑱","⑰","⑯","⑮","⑭","⑬","⑫","⑪","⑩","⑨","⑧","⑦","�",'〤',"                                                                                                                    ",'‣','exit;','〆','ㄿ','ㄿ');
	$file=str_replace($awal,$akhir,$file);
     return $file;
}
function tubasya_compiler($__________IMTB__________15){
     print_r(base64_decode(tubasya_decode(base64_decode(tubasya_decode(gzuncompress($__________IMTB__________15))))));
}
function tubasya_decompiler($__________IMTB__________15){
     $__________IMTB__________15=gzcompress(tubasya_decode(base64_encode($__________IMTB__________15)));
	return $__________IMTB__________15;
}

